<!-- 时间线编辑模块 -->
<template>
    <div class="timeline">
        <a-affix class="timeline__nav" :offsetTop="80">
            <a-anchor>
                <a-anchor-link
                    v-for="item in tempData.data"
                    :key="item.id"
                    @click.prevent
                    :href="'#' + item.id"
                >{{ item.timeSlot }}</a-anchor-link>
            </a-anchor>
        </a-affix>
        <section class="timeline__section">
            <div class="wrapper">
                <div v-for="item in tempData.data" :key="item.id" :id="item.id">
                    <h2 class="milestone">{{ item.timeSlot }}</h2>
                    <p>{{ item.desc }}</p>
                </div>
            </div>
        </section>
    </div>
</template>

<script setup lang="ts">
import { reactive } from 'vue';

const tempData = reactive({
    data: [
        { id: '_1', timeSlot: 1993, title: 'xxxxx', desc: 'По сути, стратегия позиционирования определяет рекламный макет. Маркетинговая активность отражает медиаплан, не считаясь с затратами. Общество потребления переворачивает ролевой поведенческий таргетинг.' },
        { id: '_2', timeSlot: 1994, title: 'xxxxx', desc: 'По сути, стратегия позиционирования определяет рекламный макет. Маркетинговая активность отражает медиаплан, не считаясь с затратами. Общество потребления переворачивает ролевой поведенческий таргетинг.' },
        { id: '_3', timeSlot: 1995, title: 'xxxxx', desc: 'По сути, стратегия позиционирования определяет рекламный макет. Маркетинговая активность отражает медиаплан, не считаясь с затратами. Общество потребления переворачивает ролевой поведенческий таргетинг.' },
        { id: '_4', timeSlot: 1996, title: 'xxxxx', desc: 'По сути, стратегия позиционирования определяет рекламный макет. Маркетинговая активность отражает медиаплан, не считаясь с затратами. Общество потребления переворачивает ролевой поведенческий таргетинг.' },
        { id: '_5', timeSlot: 1997, title: 'xxxxx', desc: 'По сути, стратегия позиционирования определяет рекламный макет. Маркетинговая активность отражает медиаплан, не считаясь с затратами. Общество потребления переворачивает ролевой поведенческий таргетинг.' },
        { id: '_6', timeSlot: 1998, title: 'xxxxx', desc: 'По сути, стратегия позиционирования определяет рекламный макет. Маркетинговая активность отражает медиаплан, не считаясь с затратами. Общество потребления переворачивает ролевой поведенческий таргетинг.' },
        { id: '_7', timeSlot: 1999, title: 'xxxxx', desc: 'По сути, стратегия позиционирования определяет рекламный макет. Маркетинговая активность отражает медиаплан, не считаясь с затратами. Общество потребления переворачивает ролевой поведенческий таргетинг.' },
        { id: '_8', timeSlot: 2000, title: 'xxxxx', desc: 'По сути, стратегия позиционирования определяет рекламный макет. Маркетинговая активность отражает медиаплан, не считаясь с затратами. Общество потребления переворачивает ролевой поведенческий таргетинг.' },
        { id: '_9', timeSlot: 2001, title: 'xxxxx', desc: 'По сути, стратегия позиционирования определяет рекламный макет. Маркетинговая активность отражает медиаплан, не считаясь с затратами. Общество потребления переворачивает ролевой поведенческий таргетинг.' },
        { id: '_10', timeSlot: 2002, title: 'xxxxx', desc: 'По сути, стратегия позиционирования определяет рекламный макет. Маркетинговая активность отражает медиаплан, не считаясь с затратами. Общество потребления переворачивает ролевой поведенческий таргетинг.' },
        { id: '_11', timeSlot: 2003, title: 'xxxxx', desc: 'По сути, стратегия позиционирования определяет рекламный макет. Маркетинговая активность отражает медиаплан, не считаясь с затратами. Общество потребления переворачивает ролевой поведенческий таргетинг.' },
        { id: '_12', timeSlot: 2004, title: 'xxxxx', desc: 'По сути, стратегия позиционирования определяет рекламный макет. Маркетинговая активность отражает медиаплан, не считаясь с затратами. Общество потребления переворачивает ролевой поведенческий таргетинг.' },
        { id: '_13', timeSlot: 2005, title: 'xxxxx', desc: 'По сути, стратегия позиционирования определяет рекламный макет. Маркетинговая активность отражает медиаплан, не считаясь с затратами. Общество потребления переворачивает ролевой поведенческий таргетинг.' },
        { id: '_14', timeSlot: 2006, title: 'xxxxx', desc: 'По сути, стратегия позиционирования определяет рекламный макет. Маркетинговая активность отражает медиаплан, не считаясь с затратами. Общество потребления переворачивает ролевой поведенческий таргетинг.' }]
})
</script>

<style lang="scss" scoped>
.timeline {
    position: relative;
    width: 100%;
    height: calc(100vh - 92px);
    padding: 0;
    text-align: left;
    // overflow: scroll;
    .timeline__nav {
        position: fixed;
        left: 100px;
        top: 50%;
        list-style-type: none;
        transform: translateY(-50%);
        // li {
        //     margin: 15px 0;
        //     padding-left: 0;
        //     list-style-type: none;
        //     color: #bfc1c3;
        //     border-bottom: 1px dotted rgba(0, 0, 0, 0.3);
        //     cursor: pointer;
        //     transition: all 0.3s ease-out;
        //     font-size: 16px;
        // }
        .active {
            font-weight: bold;
            color: #f94125;
            border-bottom: 1px dotted transparent;
            transform: scale(1.2);
        }
    }
    .timeline__section {
        width: 650px;
        margin: 0 auto;

        .wrapper {
        }
    }
}
</style>
